examples/homuPorousInterFoam/dambreakGlassBeads/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;
//convertToMeters 0.1;


_xMax 0.89;
_yMax 0.60;
_zMax 0.1;

_xPoro1 0.30;
_xPoro2 0.59;


_xNCellLeft 30;
_xNCellPoro 29;
_xNCellRight 30;
_yNCell 120;


vertices
(
    //
    (0.0 0.0 0.0)
    (0.0 $_yMax 0.0)
    (0.0 0.0 $_zMax)
    (0.0 $_yMax $_zMax)
    
    //
    ($_xPoro1 0.0 0.0)
    ($_xPoro1 $_yMax 0.0)
    ($_xPoro1 0.0 $_zMax)
    ($_xPoro1 $_yMax $_zMax)
    
    //
    ($_xPoro2 0.0 0.0)
    ($_xPoro2 $_yMax 0.0)
    ($_xPoro2 0.0 $_zMax)
    ($_xPoro2 $_yMax $_zMax)
    
    //
    ($_xMax 0.0 0.0)
    ($_xMax $_yMax 0.0)
    ($_xMax 0.0 $_zMax)
    ($_xMax $_yMax $_zMax)
);

blocks
(
    //
    hex (0 4 5 1 2 6 7 3) 
    leftBlock
    ($_xNCellLeft $_yNCell 1) simpleGrading (1 1 1)
    
    //
    hex (4 8 9 5 6 10 11 7) 
    porousBlock
    ($_xNCellPoro $_yNCell 1) simpleGrading (1 1 1)
    
    //
    hex (8 12 13 9 10 14 15 11) 
    rightBlock
    ($_xNCellRight $_yNCell 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 2 3 1)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (12 13 15 14)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 6 2)
            (8 12 14 10)
        );
    }
    porosityWall
    {
        type wall;
        faces
        (
            (4 8 10 6)
            (5 7 11 9)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (1 3 7 5)
            (9 11 15 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
